{"id":1,"text":"Phone\nEmail\n082367903648\nderrickvericho@gmail.com Project LinkLinkedIn\nhttps:\/\/github.com\/DerrickVericho\nhttps:\/\/www.linkedin.com\/in\/derrick-\nvericho-268563225\/Derrick Vericho\nUNDERGRADUATE DATA SCIENCE\nSTUDENT\nI’m a 5th-semester undergraduate student with a strong passion for data science and artificial intelligence, particularly\nin building solutions that connect technology with real-world needs. My interest lies in combining data-driven insights\nwith the financial industry, exploring how AI can create smarter and more impactful services. Through various projects, I\nhave developed skills in data analysis, machine learning, and system development, while continuously seeking\nchallenges that push me to grow. ABOUT ME\nSecond author & Corresponding author on published paper “Vision Transformer and CNNs in Kidney Stone\nClassification: A Comparative Study” acceptance on ICCSCIACTIVITIES\nActivist Data Science Club: Research DivisionSKILL\nRelevant Course: Deep Learning, Machine Learning, Model Deployment, Bayesian Data Analysis, Artificial Intelligence, Data Strucure,\nAlgorithm Programming, Text Mining, Big Data & Infrastructure, Software Engineering, Database TechnologyEDUCATION\nData Science, School of Computer Science, GPA: 3.57\nBinus University 2023 - present\nProgramming & Tools: Python, SQL, Docker, Git, Node.js, Typescript, n8n\nML & AI Frameworks: TensorFlow, PyTorch, scikit-learn, FastAPI, LangChain\nNLP & LLM: HuggingFace, Transformers, Prompt Engineering, RAG, VectorDB\nDatabases: MySQL, PostgreSQL\nPROJECTS\nFinance AI Expert Chatbot\nDeveloped an AI-powered chatbot that provides personalized insights on stock analysis, crypto trends, and portfolio management.\nBuilt an interactive web app using Streamlit, integrating conversational AI models for real-time financial Q&A.\nSimplified complex financial concepts into user-friendly explanations, improving accessibility for students and beginner investors.\nApplied interdisciplinary skills in AI, finance, and UI\/UX design to create a functional and engaging tool.\nSPY Forecasting using LSTM\nBuilt a machine learning web app to predict obesity levels based on lifestyle & habit data\nCompared Random Forest vs. XGBoost models for classification, selected Random Forest due to higher test accuracy (94.31% vs.\n91.94%) and strong generalization.\nDesigned intuitive UI\/UX to communicate predictions and probabilities integrated with FastAPI as backend\nObesity Level Prediction Web App\nBuilt and trained an LSTM-based deep learning model to forecast SPY ETF price movements using historical time series data.\nDesigned complete pipeline: data collection, preprocessing, sequence generation, model training, and evaluation metrics.\nAchieved strong predictive performance with: MSE: 0.0013, RMSE: 0.0362, MAE: 0.0261, R ²  Score: 0.8729.\nCERTIFICATION\nIBM Data Science\nDeveloped full data science pipeline (data wrangling, modeling, deployment) using Python, SQL, Jupyter & Watson Studio\nExecuted real-world projects: house price regression, loan default classification, cross ‑ platform flight reliability dashboard\nBuilt expertise in ML algorithms (regression, tree ‑ based, clustering), deep learning & generative AI\nNVIDIA Fundamentals of Deep Learning\nTrained CNNs for image classification\/object detection, leveraging GPU acceleration and model optimization\nApplied data augmentation & hyperparameter tuning to improve model robustness\nEmployed transfer learning to accelerate development using pretrained architectures\nDeployed end-to-end computer vision solutions, including final project (e.g. fresh vs rotten fruit classification)","label":[[1192,1204,"EDUCATION"],[1206,1232,"EDUCATION"],[1244,1260,"EDUCATION"],[1297,1303,"SKILL"],[1305,1308,"SKILL"],[1310,1316,"TOOLS"],[1318,1321,"TOOLS"],[1323,1330,"SKILL"],[1332,1342,"SKILL"],[1344,1347,"TOOLS"],[1368,1378,"SKILL"],[1380,1387,"SKILL"],[1389,1401,"SKILL"],[1403,1410,"SKILL"],[1412,1421,"SKILL"],[1433,1444,"TOOLS"],[1446,1458,"SKILL"],[1460,1478,"SKILL"],[1480,1483,"SKILL"],[1485,1493,"TOOLS"],[1505,1510,"TOOLS"],[1512,1522,"TOOLS"]],"Comments":[]}
